Функция НапечататьАкт(СсылкаНаДокумент) Экспорт

    Макет  = Документы.ВыдачаИнвентаря.ПолучитьМакет("АктВыдачи");
    ТабДок = Новый ТабличныйДокумент;
    ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктВыдачи";

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    Позиции.НомерСтроки                    КАК НомерСтроки,
        |    Позиции.Инвентарь                      КАК Инвентарь,
        |    Позиции.Инвентарь.ИнвентарныйНомер     КАК ИнвентарныйНомер,
        |    Позиции.Количество                     КАК Количество
        |ИЗ
        |    Документ.ВыдачаИнвентаря.Позиции КАК Позиции
        |ГДЕ
        |    Позиции.Ссылка = &Ссылка
        |УПОРЯДОЧИТЬ ПО
        |    НомерСтроки";
    Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
    Выборка = Запрос.Выполнить().Выбрать();

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьШапка.Параметры.Организация = Константы.НаименованиеОрганизации.Получить();
    ОбластьШапка.Параметры.Номер       = СсылкаНаДокумент.Номер;
    ОбластьШапка.Параметры.Дата        = Формат(СсылкаНаДокумент.Дата, "ДЛФ=DD");
    ОбластьШапка.Параметры.Сотрудник   = СсылкаНаДокумент.Сотрудник;
    ОбластьШапка.Параметры.Должность   = СсылкаНаДокумент.Сотрудник.Должность;
    ТабДок.Вывести(ОбластьШапка);

    ТабДок.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));

    ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
    ВсегоПозиций  = 0;
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);
        ТабДок.Вывести(ОбластьСтрока);
        ВсегоПозиций = ВсегоПозиций + 1;
    КонецЦикла;

    ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
    ОбластьПодвал.Параметры.ВсегоПозиций = ВсегоПозиций;
    ТабДок.Вывести(ОбластьПодвал);

    ТабДок.ОтображатьСетку   = Ложь;
    ТабДок.ТолькоПросмотр    = Истина;

    Возврат ТабДок;

КонецФункции