Процедура ОбработкаПроведения(Отказ, Режим)

    Движения.ИнвентарьУСотрудников.Записывать = Истина;

    Для Каждого СтрокаПозиции Из Позиции Цикл

        Движение = Движения.ИнвентарьУСотрудников.Добавить();
        Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
        Движение.Период       = Дата;
        Движение.Сотрудник    = Сотрудник;
        Движение.Инвентарь    = СтрокаПозиции.Инвентарь;
        Движение.Количество   = СтрокаПозиции.Количество;

    КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

    Если Позиции.Количество() = 0 Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Не заполнена табличная часть ""Позиции""";
        Сообщение.Поле  = "Позиции";
        Сообщение.УстановитьДанные(ЭтотОбъект);
        Сообщение.Сообщить();
        Отказ = Истина;
    КонецЕсли;

    Для Каждого Строка Из Позиции Цикл
        Если Строка.Количество <= 0 Тогда
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = "Количество должно быть больше нуля";
            Сообщение.Поле  = "Позиции[" + (Строка.НомерСтроки - 1) + "].Количество";
            Сообщение.УстановитьДанные(ЭтотОбъект);
            Сообщение.Сообщить();
            Отказ = Истина;
        КонецЕсли;
    КонецЦикла;

КонецПроцедуры